VDowbensky/LoRa-platform/FW/usb_hc32/vcp_single_072/usb_lib/ctl_drv/usb_otg_regs.h
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file usbd_desc.h
 **
 ** A detailed description is available at
 ** @link hardware registers @endlink
 **
 **   - 2019-06-28  lsq   First version for USB demo.
 **
 ******************************************************************************/
#ifndef __USB_OTG_REGS_H__
#define __USB_OTG_REGS_H__

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <stdint.h>
#include "usb_conf.h"

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
#ifndef __IO
	#define     __IO    volatile
#endif

#define USB_OTG_HS_BASE_ADDR                 0x40080000
#define USB_OTG_FS_BASE_ADDR                 0x40040000

#define USB_OTG_CORE_GLOBAL_REGS_OFFSET      0x000
#define USB_OTG_DEV_GLOBAL_REG_OFFSET        0x800
#define USB_OTG_DEV_IN_EP_REG_OFFSET         0x900
#define USB_OTG_EP_REG_OFFSET                0x20
#define USB_OTG_DEV_OUT_EP_REG_OFFSET        0xB00
#define USB_OTG_HOST_GLOBAL_REG_OFFSET       0x400
#define USB_OTG_HOST_PORT_REGS_OFFSET        0x440
#define USB_OTG_HOST_CHAN_REGS_OFFSET        0x500
#define USB_OTG_CHAN_REGS_OFFSET             0x20
#define USB_OTG_PCGCCTL_OFFSET               0xE00
#define USB_OTG_DATA_FIFO_OFFSET             0x1000
#define USB_OTG_DATA_FIFO_SIZE               0x1000


#define USB_OTG_MAX_TX_FIFOS                 15  //注意：DIEPTXFn(DPTXFSIZn)取值范围1-15，不含端点0

#define USB_OTG_HS_MAX_PACKET_SIZE           512
#define USB_OTG_FS_MAX_PACKET_SIZE           64
#define USB_OTG_MAX_EP0_SIZE                 64

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/

typedef struct _USB_OTG_GREGS  //000h
{
    __IO uint32_t GOTGCTL;      /* USB_OTG Control and Status Register    000h*/
    __IO uint32_t GOTGINT;      /* USB_OTG Interrupt Register             004h*/
    __IO uint32_t GAHBCFG;      /* Core AHB Configuration Register    008h*/
    __IO uint32_t GUSBCFG;      /* Core USB Configuration Register    00Ch*/
    __IO uint32_t GRSTCTL;      /* Core Reset Register                010h*/
    __IO uint32_t GINTSTS;      /* Core Interrupt Register            014h*/
    __IO uint32_t GINTMSK;      /* Core Interrupt Mask Register       018h*/
    __IO uint32_t GRXSTSR;      /* Receive Sts Q Read Register        01Ch*/
    __IO uint32_t GRXSTSP;      /* Receive Sts Q Read & POP Register  020h*/
    __IO uint32_t GRXFSIZ;      /* Receive FIFO Size Register         024h*/
    __IO uint32_t GNPTXFSIZ;   /* EP0 / Non Periodic Tx FIFO Size Register 028h*/
    __IO uint32_t GNPTXSTS;     /* Non Periodic Tx FIFO/Queue Sts reg 02Ch*/
    __IO uint32_t GI2CCTL;     /*  reg 030h*/
    __IO uint32_t GPVNDCTL;     /*  reg 034h*/
    __IO uint32_t GGPIO;        /* General Purpose IO Register        038h*/
    __IO uint32_t GUID;          /* User ID Register                   03Ch*/
    uint32_t  Reserved40[48];   /* Reserved                      040h-0FFh*/
    __IO uint32_t HPTXFSIZ; /* Host Periodic Tx FIFO Size Reg     100h*/
    __IO uint32_t DPTXFSIZ[USB_OTG_MAX_TX_FIFOS];/* dev Periodic Transmit FIFO */
}USB_OTG_GREGS;

typedef struct _USB_OTG_DREGS // 800h
{
    volatile uint32_t DCFG;         /* dev Configuration Register   800h*/
    volatile uint32_t DCTL;         /* dev Control Register         804h*/
    volatile uint32_t DSTS;         /* dev Status Register (RO)     808h*/
    uint32_t Reserved0C;           /* Reserved                     80Ch*/
    volatile uint32_t DIEPMSK;   /* dev IN Endpoint Mask         810h*/
    volatile uint32_t DOEPMSK;  /* dev OUT Endpoint Mask        814h*/
    volatile uint32_t DAINT;     /* dev All Endpoints Itr Reg    818h*/
    volatile uint32_t DAINTMSK; /* dev All Endpoints Itr Mask   81Ch*/
    uint32_t  Reserved20;          /* Reserved                     820h*/
    uint32_t Reserved9;       /* Reserved                     824h*/
    volatile uint32_t DVBUSDIS;    /* dev VBUS discharge Register  828h*/
    volatile uint32_t DVBUSPULSE;  /* dev VBUS Pulse Register      82Ch*/
    volatile uint32_t DTHRCTL;     /* dev thr                      830h*/
    volatile uint32_t DIEPEMPMSK; /* dev empty msk             834h*/
    volatile uint32_t DEACHINT;    /* dedicated EP interrupt       838h*/
    volatile uint32_t DEACHMSK;    /* dedicated EP msk             83Ch*/
}USB_OTG_DREGS;

typedef struct _USB_OTG_INEPREGS
{
    volatile uint32_t DIEPCTL; /* dev IN Endpoint Control Reg 900h + (ep_num * 20h) + 00h*/
    uint32_t Reserved04;             /* Reserved                       900h + (ep_num * 20h) + 04h*/
    volatile uint32_t DIEPINT; /* dev IN Endpoint Itr Reg     900h + (ep_num * 20h) + 08h*/
    uint32_t Reserved0C;             /* Reserved                       900h + (ep_num * 20h) + 0Ch*/
    volatile uint32_t DIEPTSIZ; /* IN Endpoint Txfer Size   900h + (ep_num * 20h) + 10h*/
    volatile uint32_t DIEPDMA; /* IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h*/
    volatile uint32_t DTXFSTS;/*IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h*/
    uint32_t Reserved18;             /* Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch*/
}USB_OTG_INEPREGS;

typedef struct _USB_OTG_OUTEPREGS
{
    volatile uint32_t DOEPCTL;       /* dev OUT Endpoint Control Reg  B00h + (ep_num * 20h) + 00h*/
    uint32_t Reserved04;         /* Reserved                      B00h + (ep_num * 20h) + 04h*/
    volatile uint32_t DOEPINT;       /* dev OUT Endpoint Itr Reg      B00h + (ep_num * 20h) + 08h*/
    uint32_t Reserved0C;         /* Reserved                      B00h + (ep_num * 20h) + 0Ch*/
    volatile uint32_t DOEPTSIZ;      /* dev OUT Endpoint Txfer Size   B00h + (ep_num * 20h) + 10h*/
    volatile uint32_t DOEPDMA;       /* dev OUT Endpoint DMA Address  B00h + (ep_num * 20h) + 14h*/
    uint32_t Reserved18[2];      /* Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch*/
}USB_OTG_OUTEPREGS;

